src/Catalogs/Files.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Files</Name>
			<Comment>Files in folders</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Comment>Author - User, who added the file</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FileFolders</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Comment>Date of adding file to the database</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Encrypted</Name>
					<Comment>Encrypted</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PictureIndex</Name>
					<Comment>Index of an icon, corresponding to the file extension, to be displayed in the list</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Comment>File description</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Signed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileName</Name>
					<Comment>Full description (of length of up to 256 chars)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LockedBy</Name>
					<Comment>User, locked file for edit</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextStorage</Name>
					<Comment>Text, extracted from file - for full-text search</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersion</Name>
					<Comment>Active version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionAuthor</Name>
					<Comment>Author - User, who created the version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionDateCreated</Name>
					<Comment>Version create date</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVersionNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionFilePath</Name>
					<Comment>Additional path to a file on drive (in case if FileStorageType - "on drive")</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionSize</Name>
					<Comment>Size of versions' file</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionExtension</Name>
					<Comment>Version file extension</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVolume</Name>
					<Comment>Ref to volume (if FileStorageType = 'on drive' )</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileStorageVolumes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StoreVersions</Name>
					<Comment>Store versions - if False, file always has single Active version</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalDataAndAttributes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalDataAndAttributes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>EncryptionCertificates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Imprint</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Files/Forms/OpenedForEditingFiles/Ext/Form/Module.bsl
// Handle event Selection of list
//
&AtClient
Procedure ListSelection(Item, RowSelected, Field, StandardProcessing)
	
	FileOperationsClient.OpenFile(
		FileOperations.GetFileDataForOpening(RowSelected, Undefined, Uuid)); 
	StandardProcessing = False;
	
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancellation, StandardProcessing)
	
	User = CommonUse.CurrentUser();
	FileList.Parameters.SetParameterValue("LockedBy", User);
	
	ShowColumnSize = FileOperations.GetShowColumnSize();
	If ShowColumnSize = False Then
		Items.CurrentVersionSize.Visible = False;
	EndIf;
				   
EndProcedure

&AtClient
Procedure ListBeforeAddRow(Item, Cancellation, Clone, Parent, Folder)
	Cancellation = True;
EndProcedure

&AtClient
Procedure EndEdit(Command)
	
	If Items.List.CurrentRow = Undefined Then 
		Return;
	EndIf;
	
	LockedByCurrentUser = True;	
	FileOperationsCommands.EndEdit(
		Items.List.CurrentRow,
		Uuid,
		Items.List.CurrentData.StoreVersions,
		LockedByCurrentUser,
		Items.List.CurrentData.LockedBy,
		Items.List.CurrentData.Author);
		
EndProcedure

&AtClient
Procedure OpenFile(Command)
	
	If Items.List.CurrentRow = Undefined Then 
		Return;
	EndIf;
	
	FileData = FileOperations.GetFileDataForOpening(Items.List.CurrentRow, Undefined, Uuid);
	FileOperationsCommands.Open(FileData);
	
EndProcedure

&AtClient
Procedure Release(Command)
	
	If Items.List.CurrentRow = Undefined Then 
		Return;
	EndIf;
	
	LockedByCurrentUser = True;
	FileOperationsCommands.UnlockFile(
		Items.List.CurrentRow,
		Items.List.CurrentData.StoreVersions,
		LockedByCurrentUser,
		Items.List.CurrentData.LockedBy);
		
EndProcedure

&AtClient
Procedure SaveChanges(Command)
	
	If Items.List.CurrentRow = Undefined Then 
		Return;
	EndIf;
	
	FileOperationsCommands.SaveAs(Items.List.CurrentRow);
	
EndProcedure

&AtClient
Procedure OpenFileDirectory(Command)
	
	If Items.List.CurrentRow = Undefined Then 
		Return;
	EndIf;
	
	FileData = FileOperations.GetFileDataForOpening(
		Items.List.CurrentRow, Undefined, Uuid);
	
	FileOperationsCommands.OpenFileDirectory(FileData);
	
EndProcedure

&AtClient
Procedure SaveAs(Command)
	
	If Items.List.CurrentRow = Undefined Then 
		Return;
	EndIf;
	
	FileData = FileOperations.GetFileDataForSaving(
		Items.List.CurrentRow, 
		Undefined, 
		Uuid);
	
	FileOperationsCommands.SaveAs(FileData);
	
EndProcedure

&AtClient
Procedure UpdateFromFileOnDisk(Command)
	If Items.List.CurrentRow = Undefined Then 
		Return;
	EndIf;
	
	FileData = FileOperations.GetFileDataAndWorkingDirectory(Items.List.CurrentRow);
	FileOperationsCommands.UpdateFromFileOnDisk(FileData, Uuid);
EndProcedure

&AtClient
Procedure SetAccessibilityOfCommands(Enabled)
	Items.EndEdit.Enabled = Enabled;
	Items.ListContextMenu.ChildItems.ContextMenuListEndEdit.Enabled = Enabled;
	
	Items.OpenFile.Enabled = Enabled;
	Items.ListContextMenu.ChildItems.ContextMenuListOpenFile.Enabled = Enabled;
	
	Items.Change.Enabled = Enabled;
	
	Items.ListContextMenu.ChildItems.ContextMenuListSaveChanges.Enabled 			= Enabled;
	Items.ListContextMenu.ChildItems.ContextMenuListOpenFileDirectory.Enabled 		= Enabled;
	Items.ListContextMenu.ChildItems.ContextMenuListSaveAs.Enabled 					= Enabled;
	Items.ListContextMenu.ChildItems.ContextMenuListRelease.Enabled 				= Enabled;
	Items.ListContextMenu.ChildItems.ContextMenuListRefreshFromFileAtDrive.Enabled 	= Enabled;
EndProcedure

&AtClient
Procedure ListOnActivateRow(Item)
	
	If Items.List.CurrentRow = Undefined Then
		SetAccessibilityOfCommands(False);
	Else
		SetAccessibilityOfCommands(True);
	EndIf;	
	                                       	
EndProcedure
